Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/*
 * GRBL-like G-code system command and real-time handling for UGS compatibility.
 * Real-time chars: ?, ~, !, 0x18 (Ctrl+X soft reset)
 * System commands: $$, $#, $G, $I, $N / $Nn=, $C, $X, $RST=*, $RST=$, $RST=#, $F, single $
 * Generic settings read/write: $<number>, $<number>=<value>
 * G-code queue + event translation (subset)
 *
 * Soft reset handling (Ctrl+X and literal "0x18") uses UART_SoftReset() (uart_utils.c).
 */

#include <stddef.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <ctype.h>
#include <math.h>

#include "gcode_parser.h"
#include "common.h"
#include "app.h"          // For APP_Initialize()
#include "stepper.h"
#include "motion.h"
#include "motion_utils.h" // For MOTION_UTILS_EnableAllAxes()
#include "kinematics.h"
#include "motion/homing.h"
#include "utils.h"
#include "settings.h"
#include "data_structures.h"
#include "utils/uart_utils.h"
#include "../config/default/peripheral/uart/plib_uart3.h"
#include <xc.h>  // For RSWRST, SYSKEY, and processor registers
#include "definitions.h"                  // For T4CON/_T4CON_ON_MASK (hardware state)
#include "../config/default/peripheral/gpio/plib_gpio.h"  // For LED debug

/* -------------------------------------------------------------------------- */
/* Configuration                                                              */
/* -------------------------------------------------------------------------- */
#define ENABLE_STARTUP_BANNER     // Enable/disable startup banner
                                  // G-code senders (UGS, bCNC) expect this banner
                                  // Comment out to disable for debugging or custom ID

// Banner message configured in common.h via STARTUP_BANNER_STRING macro

// Dual-threshold flow control for UGS compatibility
// HIGH_WATER: Start deferring "ok" when queue reaches this (almost full)
// LOW_WATER: Resume sending "ok" when queue drains to this (some space freed)
// With MAX=16: Defer at 14 (2 free), Resume at 12 (4 drained)
#define MOTION_BUFFER_HIGH_WATER 2    // Defer when (MAX - 2) = 14 segments used
#define MOTION_BUFFER_LOW_WATER  4    // Resume when (MAX - 4) = 12 segments used

/* -------------------------------------------------------------------------- */
/* Static Buffers / State                                                     */
/* -------------------------------------------------------------------------- */
static uint8_t txBuffer[1024];
static uint8_t rxBuffer[512];  // Increased to match UART3 RX buffer size
static volatile uint32_t nBytesRead = 0;

GCODE_Data gcodeData = {
    .state = GCODE_STATE_IDLE,
};


/* ✅ REMOVED: Startup deferral variables (caused UGS stalling) */

/* -------------------------------------------------------------------------- */
/* Forward Declarations                                                       */
/* -------------------------------------------------------------------------- */
static inline bool is_control_char(uint8_t c){ return (c == '?' || c == '~' || c == '!' || c == 0x18); }
GCODE_CommandQueue* Extract_CommandLineFrom_Buffer(uint8_t* buffer, uint32_t length, GCODE_CommandQueue* commandQueue);


static inline char* find_char(char* s, char key){
    while (*s){
        if (*s == key) return s;
        s++;
    }
    return NULL;
}
static float parse_float_after(char* start){
    if (!start || !start[1]) return 0.0f;
    return (float)strtof(start + 1, NULL);
}

/* -------------------------------------------------------------------------- */
/* Centralized Soft Reset (PUBLIC FUNCTION)                                  */
/* -------------------------------------------------------------------------- */
void GCODE_SoftReset(APP_DATA* appData, GCODE_CommandQueue* cmdQueue)
{
    (void)appData;     // Unused - hardware reset doesn't need state cleanup
    (void)cmdQueue;    // Unused - hardware reset doesn't need state cleanup
    
    DEBUG_PRINT_GCODE("[SOFT RESET] Executing HARDWARE RESET via RSWRST register\r\n");
    
    /* PIC32MZ Software Reset Sequence (from datasheet Section 6.4.2)
     * 1. Perform SYSKEY unlock sequence
     * 2. Write '1' to RSWRST.SWRST bit
     * 3. Read RSWRST register - triggers reset
     * 
     * This is a COMPLETE hardware reset - jumps to reset vector at 0xBFC00000
     * All peripherals, RAM, registers reset to power-on state
     * Bootloader takes over, jumps to application start
     * APP_Initialize() runs automatically on startup
     */
    
    // Disable interrupts during reset sequence
    __builtin_disable_interrupts();
    
    // SYSKEY unlock sequence (required to write RSWRST)
    SYSKEY = 0x00000000;  // Force lock
    SYSKEY = 0xAA996655;  // Key 1
    SYSKEY = 0x556699AA;  // Key 2 - system now unlocked
    
    // Set SWRST bit to trigger software reset
    RSWRSTSET = _RSWRST_SWRST_MASK;
    
    // Read RSWRST to trigger the reset (per datasheet Note 2)
    (void)RSWRST;
    
    // Execution never reaches here - reset occurs immediately after read
    while(1);  // Safety loop (never executes)
}

/* -------------------------------------------------------------------------- */
/* USART Initialization                                                       */
/* -------------------------------------------------------------------------- */
void GCODE_USART_Initialize(APP_DATA* appData, uint32_t RD_thresholds)
{
    (void)RD_thresholds;
    UART_Initialize();
    
    /* Print GRBL startup banner (disable for custom firmware identification) */
#ifdef ENABLE_STARTUP_BANNER
    UART_SEND_BANNER();  // Compile-time string and length from common.h
#endif

    nBytesRead = 0;
    memset(rxBuffer, 0, sizeof(rxBuffer));
    if (appData) {
        appData->gcodeParser.okPendingCount = 0;
        appData->gcodeParser.grblCheckMode = false;
        appData->gcodeParser.grblAlarm = false;
        appData->gcodeParser.feedHoldActive = false;
        appData->gcodeParser.unitsInches = false;
        memset(appData->gcodeParser.startupLines, 0, sizeof(appData->gcodeParser.startupLines));
    }
    gcodeData.state = GCODE_STATE_IDLE;

    // ✅ REMOVED: Startup deferral initialization (no longer used)
}

