Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Helper: queue command (assumes space available already checked)           */
/* -------------------------------------------------------------------------- */
static inline void queue_command(GCODE_CommandQueue* q, const char* src, size_t len){
    if (len == 0 || len >= GCODE_BUFFER_SIZE) return;
    memcpy(q->commands[q->head].command, src, len);
    q->commands[q->head].command[len] = '\0';
    q->head = (q->head + 1) % GCODE_MAX_COMMANDS;
    q->count++;
}

/* -------------------------------------------------------------------------- */
/* Helper: split combined modal tokens like "G21G90" or "G90G0Z5"             */
/* Rules:
 *  - Multiple G/M words may be concatenated.
 *  - Parameters belong to the final word only (e.g. G90G0X1 -> "G90", "G0X1")
 *  - Return number of pieces queued.
 * -------------------------------------------------------------------------- */
static uint32_t split_and_queue_multi_modal(GCODE_CommandQueue* q, char* token)
{
    uint32_t pieces = 0;
    size_t len = strlen(token);
    if (len < 3) { /* Too short to contain combined words */
        queue_command(q, token, len);
        return 1;
    }

    /* Collect positions of G/M designators */
    uint8_t pos[8];
    uint8_t posCount = 0;
    for (size_t i = 0; i < len && posCount < (sizeof(pos)/sizeof(pos[0])); i++){
        char c = token[i];
        if (c == 'G' || c == 'M'){
            pos[posCount++] = (uint8_t)i;
        }
    }

    if (posCount <= 1){
        queue_command(q, token, len);
        return 1;
    }

    /* For each modal except last, emit substring up to next modal start */
    for (uint8_t i = 0; i < posCount - 1; i++){
        uint8_t start = pos[i];
        uint8_t end   = pos[i+1];
        if (end > start){
            queue_command(q, &token[start], (size_t)(end - start));
            pieces++;
        }
    }
    /* Last piece: from last modal start to end of original token */
    queue_command(q, &token[pos[posCount-1]], len - pos[posCount-1]);
    pieces++;
    return pieces;
}

/* -------------------------------------------------------------------------- */
/* Extract line and tokenize                                                  */
/* -------------------------------------------------------------------------- */
GCODE_CommandQueue* Extract_CommandLineFrom_Buffer(uint8_t* buffer, uint32_t length, GCODE_CommandQueue* commandQueue)
{
    GCODE_CommandQueue* cmdQueue = commandQueue;
    char line_buffer[256];
    uint32_t safe_length = (length < sizeof(line_buffer) - 1U) ? length : (sizeof(line_buffer) - 1U);
    memcpy(line_buffer, buffer, safe_length);
    line_buffer[safe_length] = '\0';

    for (uint32_t i = 0; i < safe_length; i++) {
        char c = line_buffer[i];
        if (c >= 'a' && c <= 'z') line_buffer[i] = (char)(c - 'a' + 'A');
    }

    uint32_t write_pos = 0;
    for (uint32_t read_pos = 0; read_pos < safe_length; read_pos++) {
        char c = line_buffer[read_pos];
        if ((c >= 32 && c <= 126) || c == '\r' || c == '\n' || c == '\t')
            line_buffer[write_pos++] = c;
    }
    line_buffer[write_pos] = '\0';
    safe_length = write_pos;

    TokenArray tokens;
    uint32_t token_count = UTILS_TokenizeGcodeLine(line_buffer, &tokens);

    for (uint32_t i = 0; i < token_count; i++) {
        if (UTILS_IsEmptyString(tokens.tokens[i]) || UTILS_IsComment(tokens.tokens[i])) continue;
        if (((cmdQueue->head + 1) % GCODE_MAX_COMMANDS) == cmdQueue->tail) break; /* queue full */

        /* Detect combined modal sequences (must start with G/M and contain another G/M) */
        bool combined = false;
        if (tokens.tokens[i][0] == 'G' || tokens.tokens[i][0] == 'M'){
            for (char* p = tokens.tokens[i] + 1; *p; ++p){
                if (*p == 'G' || *p == 'M'){
                    combined = true;
                    break;
                }
            }
        }

        if (combined){
            split_and_queue_multi_modal(cmdQueue, tokens.tokens[i]);
        } else {
            size_t tlen = UTILS_SafeStrlen(tokens.tokens[i], GCODE_BUFFER_SIZE - 1U);
            queue_command(cmdQueue, tokens.tokens[i], tlen);
        }
    }
    return cmdQueue;
}

/* -------------------------------------------------------------------------- */
/* Command -> Event Parser                                                    */
/* -------------------------------------------------------------------------- */
static bool parse_command_to_event(APP_DATA* appData, const char* cmd, GCODE_Event* ev)
{
    if (!cmd || !ev) return false;
    ev->type = GCODE_EVENT_NONE;

    // Axis letter array for scalable parsing (shared across all parsing blocks)
    static const char axis_letters[NUM_AXIS] = {'X', 'Y', 'Z', 'A'};

    DEBUG_PRINT_GCODE("[PARSE] cmd='%s'\r\n", cmd);

    if (cmd[0] == 'G') {
        char* pend = NULL;
        int gnum = (int)strtol(&cmd[1], &pend, 10);
        
        DEBUG_PRINT_GCODE("[PARSE] G-code detected: gnum=%d\r\n", gnum);

        // G20/G21 - Units (handled internally, no event needed)
    if (gnum == 20) { appData->gcodeParser.unitsInches = true; ev->type = GCODE_EVENT_NONE; return true; }
    if (gnum == 21) { appData->gcodeParser.unitsInches = false; ev->type = GCODE_EVENT_NONE; return true; }
        
        // G90/G91 - Positioning mode
        if (gnum == 90) { ev->type = GCODE_EVENT_SET_ABSOLUTE; return true; }
        if (gnum == 91) { ev->type = GCODE_EVENT_SET_RELATIVE; return true; }

        // Work coordinate system selection (G54-G59)
        if (gnum >= 54 && gnum <= 59) {
            ev->type = GCODE_EVENT_SET_WCS;
            ev->data.setWCS.wcs_number = gnum - 54;  // G54=0, G55=1, ..., G59=5
            return true;
        }

        // G92 - Set work coordinate offset (same as G10 L20 P0)
        if (gnum == 92) {
            StepperPosition* pos = STEPPER_GetPosition();
            WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
            const float unit_scale = appData->gcodeParser.unitsInches ? 25.4f : 1.0f;
            
