Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
    // System commands ($H, $X, etc.)
    if (cmd[0] == '$') {
        if (cmd[1] == 'H' && (cmd[2] == '\0' || cmd[2] == '\n' || cmd[2] == '\r')) {
            // $H - Home all axes command
            ev->type = GCODE_EVENT_HOMING;
            ev->data.homing.axes_mask = 0x0F; // Home all axes (XYZA = bits 0-3)
            return true;
        }
    }
    
    return false;
}

/* -------------------------------------------------------------------------- */
/* Public Event Retrieval                                                     */
/* -------------------------------------------------------------------------- */
bool GCODE_GetNextEvent(APP_DATA* appData, GCODE_CommandQueue* cmdQueue, GCODE_Event* event)
{
    if (!cmdQueue || !event) return false;
    if (cmdQueue->count == 0) return false;

    GCODE_Command* gc = &cmdQueue->commands[cmdQueue->tail];
    if (gc->command[0] == '\0') {
        // Empty command - consume it and return false
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        return false;
    }

    if (!parse_command_to_event(appData, gc->command, event)) {
        // Parse failed - consume command and return false
        DEBUG_PRINT_GCODE("[GetEvent] Parse failed for: '%s'\r\n", gc->command);
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        return false;
    }

    // ✅ SUCCESS: Event parsed, but DON'T consume yet!
    // Event will be consumed after successful processing via GCODE_ConsumeEvent()
    DEBUG_PRINT_GCODE("[GetEvent] Event ready: type=%d from cmd='%s'\r\n", event->type, gc->command);
    return true;
}

/**
 * @brief Consume the current event from the queue after successful processing
 * 
 * CRITICAL: Only call this AFTER successfully processing the event from GCODE_GetNextEvent!
 */
void GCODE_ConsumeEvent(GCODE_CommandQueue* cmdQueue)
{
    if (!cmdQueue) return;
    if (cmdQueue->count == 0) return;
    
    // Remove the event that was just processed
    cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
    cmdQueue->count--;
}

/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/* Removed IsOkPending/SetOkPending/ClearOkPending helpers to avoid unused warnings;
   logic now accesses okPending directly inside the flow-control helpers below. */

/**
 * @brief Compute high-water mark for flow control (when to START deferring ok)
 * 
 * Returns maxSegments - HIGH_WATER threshold
 * Example: With MAX=16, HIGH_WATER=2 → defer when queue >= 14
 */
static inline uint32_t Flow_HighWater(const GCODE_CommandQueue* q)
{
    if (q == NULL) return 0U;
    return (q->maxMotionSegments > MOTION_BUFFER_HIGH_WATER)
         ? (uint32_t)(q->maxMotionSegments - MOTION_BUFFER_HIGH_WATER)
         : 0U;
}

/**
 * @brief Compute low-water mark for flow control (when to RESUME sending ok)
 * 
 * Returns maxSegments - LOW_WATER threshold
 * Example: With MAX=16, LOW_WATER=4 → resume when queue <= 12
 */
static inline uint32_t Flow_LowWater(const GCODE_CommandQueue* q)
{
    if (q == NULL) return 0U;
    return (q->maxMotionSegments > MOTION_BUFFER_LOW_WATER)
         ? (uint32_t)(q->maxMotionSegments - MOTION_BUFFER_LOW_WATER)
         : 0U;
}

/**
 * @brief Check if we should send a deferred "ok" response
 * 
 * With aggressive flow control, only send deferred "ok" when motion queue
 * is COMPLETELY empty. This ensures UGS doesn't see "Finished" until all
 * motion has executed.
 * 
 * @param appData Application data with motion queue count
 * @param q Command queue (unused with current logic)
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    // Send deferred "ok" responses when buffer drops below low-water mark
    // This prevents deadlock on long motion files while still providing backpressure
    uint32_t lowWater = appData->gcodeCommandQueue.maxMotionSegments - MOTION_BUFFER_LOW_WATER;
    
    while (appData->gcodeParser.okPendingCount > 0 && appData->motionQueueCount < lowWater) {
        DEBUG_PRINT_GCODE("[DEFERRED] Sending deferred ok (queue=%lu < lowWater=%lu, pending=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount, (unsigned long)lowWater,
                          (unsigned long)appData->gcodeParser.okPendingCount);
        if (UART_SendOK()) {
            appData->gcodeParser.okPendingCount--;
        } else {
            break;  // TX buffer full, try again next iteration
        }
    }
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 * 
 * Called when a command is received.
 * Uses HIGH_WATER threshold - defers ok when buffer is almost full.
 * 
 * @param currentQueueCount Current motion queue count
 * @param maxSegments Maximum motion queue size
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    // ✅ Aggressive flow control to prevent UGS "Finished" before motion completes
    // Only send "ok" immediately when queue is completely empty
    // This ensures the last "ok" is sent only after all motion completes
    
    if (appData->motionQueueCount == 0) {
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (queue empty, motion complete)\r\n");
        (void)UART_SendOK();
    } else {
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (queue=%lu > 0, total pending=%lu)\r\n", 
                          (unsigned long)appData->motionQueueCount,
                          (unsigned long)(appData->gcodeParser.okPendingCount + 1));
    appData->gcodeParser.okPendingCount++;
    }
}

/* -------------------------------------------------------------------------- */
/* Main G-code / Protocol Tasks                                               */
/* -------------------------------------------------------------------------- */
void GCODE_Tasks(APP_DATA* appData, GCODE_CommandQueue* commandQueue)
{
    static uint32_t call_counter = 0;
    call_counter++;
    
    // if ((call_counter % 10000) == 0) {
    //     DEBUG_PRINT_GCODE("[GCODE_Tasks] Called %lu times, state=%d\r\n", 
    //                      call_counter, gcodeData.state);
    // }
    
    GCODE_CommandQueue* cmdQueue = commandQueue;
    uint32_t nBytesAvailable = 0;

