Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
    // ✅ CRITICAL: Check deferred "ok" ONCE at entry using FRESH count
    // If buffer drained and okPending, send "ok" immediately then continue processing
    GCODE_CheckDeferredOk(appData, cmdQueue);

    switch (gcodeData.state)
    {
    case GCODE_STATE_IDLE:
        nBytesAvailable = UART3_ReadCountGet();
        if (nBytesAvailable > 0) {
            uint32_t space = (uint32_t)(sizeof(rxBuffer) - 1U - nBytesRead);
            if (space > 0U) {
                uint32_t toRead = (nBytesAvailable < space) ? nBytesAvailable : space;
                uint32_t got = UART3_Read(&rxBuffer[nBytesRead], toRead);
                nBytesRead += got;
                rxBuffer[nBytesRead] = '\0';
            }
        } else {
            // ✅ No new bytes arriving - check for deferred ok
            // This runs every iteration when idle, ensuring final "ok" is sent
            GCODE_CheckDeferredOk(appData, cmdQueue);
        }

        if (nBytesRead == 0) {
            break;  // No data in buffer, exit IDLE state
        }

        /* Literal "0x18" typed by user */
        if (nBytesRead >= 4 &&
            rxBuffer[0] == '0' && rxBuffer[1] == 'x' &&
            rxBuffer[2] == '1' && rxBuffer[3] == '8') {
            GCODE_SoftReset(appData, cmdQueue);
            break;
        }

        if (is_control_char(rxBuffer[0])) {
            gcodeData.state = GCODE_STATE_CONTROL_CHAR;
        } else {
            bool has_terminator = false;
            uint32_t terminator_pos = 0;
            for (uint32_t i = 0; i < nBytesRead; i++) {
                if (rxBuffer[i] == '\n' || rxBuffer[i] == '\r') {
                    has_terminator = true;
                    terminator_pos = i;
                    break;
                }
            }
            if (!has_terminator) break;
            rxBuffer[terminator_pos] = '\0';

            // ✅ Check for control chars AFTER termination (handles '?' with newline)
            if (is_control_char(rxBuffer[0])) {
                gcodeData.state = GCODE_STATE_CONTROL_CHAR;
            } else if (rxBuffer[0] == '$') {
                gcodeData.state = GCODE_STATE_QUERY_CHARS;
            } else if (rxBuffer[0] == 'G' || rxBuffer[0] == 'g' ||
                       rxBuffer[0] == 'M' || rxBuffer[0] == 'm' ||
                       rxBuffer[0] == 'F' || rxBuffer[0] == 'f' ||
                       rxBuffer[0] == 'T' || rxBuffer[0] == 't' ||
                       rxBuffer[0] == 'S' || rxBuffer[0] == 's') {
                gcodeData.state = GCODE_STATE_GCODE_COMMAND;
            } else {
                // Determine if line contains G-code content (ignore pure comments / whitespace)
                bool has_content = false;
                // Find first non-whitespace character
                uint32_t first_idx = 0;
                while (first_idx < terminator_pos) {
                    char c = rxBuffer[first_idx];
                    if (c == ' ' || c == '\t') { first_idx++; continue; }
                    break;
                }
                if (first_idx < terminator_pos) {
                    char first = rxBuffer[first_idx];
                    if (first == ';' || first == '(') {
                        // Comment-only line → treat as blank, do not queue
                        has_content = false;
                    } else {
                        // Any other non-whitespace, non-comment first char counts as content
                        has_content = true;
                    }
                }
                if (has_content) {
                    DEBUG_PRINT_GCODE("[IDLE] Processing line: '%s'\r\n", rxBuffer);
                    cmdQueue = Extract_CommandLineFrom_Buffer(rxBuffer, terminator_pos, cmdQueue);
                    
                    // ✅ Send "ok" for all lines with content
                    DEBUG_PRINT_GCODE("[IDLE] Sending ok for content line\r\n");
                    SendOrDeferOk(appData, cmdQueue);
                } else {
                    // ✅ GRBL v1.1 behavior: Blank lines get "ok" response
                    // UGS counts ALL lines including blanks, so we must respond
                    // Flow control applies - will defer if motion queue has content
                    DEBUG_PRINT_GCODE("[IDLE] Blank/comment line - sending ok with flow control\r\n");
                    SendOrDeferOk(appData, cmdQueue);
                }
                uint32_t skip_pos = terminator_pos + 1;
                while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n'))
                    skip_pos++;
                uint32_t remaining_bytes = nBytesRead - skip_pos;
                if (remaining_bytes > 0) {
                    memmove(rxBuffer, &rxBuffer[skip_pos], remaining_bytes);
                    nBytesRead = remaining_bytes;
                    rxBuffer[nBytesRead] = '\0';
                } else {
                    nBytesRead = 0;
                    memset(rxBuffer, 0, sizeof(rxBuffer));
                }
                // After consuming a line, attempt to release any deferred ok now that we may have headroom
                GCODE_CheckDeferredOk(appData, cmdQueue);
                break;
            }
        }
        /* fall-through */

    case GCODE_STATE_CONTROL_CHAR:
    {
        if (gcodeData.state != GCODE_STATE_CONTROL_CHAR) break;

        uint8_t c = rxBuffer[0];
        switch (c) {
            case '?': {
                StepperPosition* pos = STEPPER_GetPosition();
                WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();

                // Array-based position calculation with loop for scalability
                float mpos[NUM_AXIS];
                float wpos[NUM_AXIS];
                
                for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                    mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
                    wpos[axis] = mpos[axis] - GET_COORDINATE_AXIS(&wcs->offset, axis);
                }

                const char* state = "Idle";
                if (appData->gcodeParser.grblAlarm) {
                    state = "Alarm";
                } else if (appData->gcodeParser.feedHoldActive) {
                    state = "Hold";
                } else if (appData->arcGenState == ARC_GEN_ACTIVE) {
                    // Arc generator active → still processing arc segments
                    state = "Run";
                } else if ((T4CON & _T4CON_ON_MASK) != 0) {
                    // Hardware timer running → motion in progress (or about to start)
                    state = "Run";
                } else if (appData->currentSegment != NULL &&
                           appData->currentSegment->steps_completed < appData->currentSegment->steps_remaining) {
                    state = "Run";
                } else if (appData->motionQueueCount > 0) {
                    state = "Run";
                }

                float feedrate_mm_min = (state[0] == 'R') ? appData->modalFeedrate : 0.0f;
                if (state[0] == 'R' && feedrate_mm_min <= 0.0f) {
                    feedrate_mm_min = (appData->modalFeedrate > 0.0f) ? appData->modalFeedrate : 600.0f;
                    appData->modalFeedrate = feedrate_mm_min;
                }
                uint32_t spindle_rpm = appData->modalSpindleRPM;

                uint32_t response_len = (uint32_t)snprintf((char*)txBuffer, sizeof(txBuffer),
                    "<%s|MPos:%.3f,%.3f,%.3f|WPos:%.3f,%.3f,%.3f|FS:%.0f,%u%s%s>\r\n",
                    state, 
                    mpos[AXIS_X], mpos[AXIS_Y], mpos[AXIS_Z], 
                    wpos[AXIS_X], wpos[AXIS_Y], wpos[AXIS_Z],
                    feedrate_mm_min, (unsigned)spindle_rpm,
                    appData->gcodeParser.grblCheckMode ? "|Cm:1" : "",
                    appData->gcodeParser.feedHoldActive ? "|FH:1" : "");
                UART3_Write(txBuffer, response_len);
                
                // ⚠️ Real-time commands NEVER trigger deferred ok checks
                // The deferred ok will be sent by IDLE loop (line 668) or next command
                break;
            }
            case '~': /* Cycle start / resume */
                if (appData->gcodeParser.feedHoldActive) {
                    appData->gcodeParser.feedHoldActive = false;
                    /* Future: Re-enable motion pipeline if paused */
                }
                break;
            case '!': /* Feed hold */
                appData->gcodeParser.feedHoldActive = true;
                STEPPER_DisableAll();
                break;
            case 0x18: /* Soft reset */
            {
                GCODE_SoftReset(appData, cmdQueue);
                break;
            }
            default:
                break;
        }

