Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
        // ✅ GRBL PROTOCOL: Real-time commands NEVER generate "ok" responses
        // Consume control character at position 0, plus any trailing CR/LF
        // This prevents "?\r\n" from leaving "\r\n" which would be processed as blank line
        uint32_t skip_pos = 1;  // Skip the control character itself
        while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n')) {
            skip_pos++;  // Skip all trailing line terminators
        }
        
        if (skip_pos < nBytesRead) {
            // Remaining bytes after control char + terminators
            memmove(rxBuffer, &rxBuffer[skip_pos], nBytesRead - skip_pos);
            nBytesRead -= skip_pos;
            rxBuffer[nBytesRead] = '\0';
            if (nBytesRead > 0 && is_control_char(rxBuffer[0])) {
                gcodeData.state = GCODE_STATE_CONTROL_CHAR;
            } else {
                gcodeData.state = GCODE_STATE_IDLE;
            }
        } else {
            // Nothing left after consuming control char and terminators - clear everything
            nBytesRead = 0;
            rxBuffer[0] = '\0';  // ✅ Ensure first byte is null
            memset(rxBuffer, 0, sizeof(rxBuffer));
            gcodeData.state = GCODE_STATE_IDLE;
        }
        break;
    }

    case GCODE_STATE_QUERY_CHARS:
    {
        const char* cmd = (const char*)rxBuffer;
        size_t len = strlen(cmd);

        bool send_ok = true;
        bool handled = false;

        if (len >= 4 && cmd[0] == '$' && cmd[1] == 'N' && isdigit((unsigned char)cmd[2]) && cmd[3] == '=') {
            int idx = cmd[2] - '0';
            if (idx == 0 || idx == 1) {
                const char* line = &cmd[4];
                size_t l = strlen(line);
                if (l >= GCODE_BUFFER_SIZE) l = GCODE_BUFFER_SIZE - 1;
                size_t w = 0;
                for (size_t i = 0; i < l && w < (GCODE_BUFFER_SIZE - 1); i++) {
                    unsigned char ch = (unsigned char)line[i];
                    if (ch == '\r' || ch == '\n') break;
                    if (ch >= 32 && ch <= 126) appData->gcodeParser.startupLines[idx][w++] = (char)ch;
                }
                appData->gcodeParser.startupLines[idx][w] = '\0';
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'J') {
            // Jog cancel (feed hold)
            appData->gcodeParser.feedHoldActive = true;
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == '#') {
            // GRBL $# command: Report work coordinate systems and offsets
            char buf[400];  // Increased buffer for all WCS data
            int p = 0;
            
            // Report all work coordinate systems (G54-G59)
            for (uint8_t wcs = 0; wcs < 6; wcs++) {
                float x, y, z;
                if (SETTINGS_GetWorkCoordinateSystem(wcs, &x, &y, &z)) {
                    p += snprintf(&buf[p], sizeof(buf)-p, "[G%d:%.3f,%.3f,%.3f]\r\n", 
                                 54 + wcs, x, y, z);
                }
            }
            
            // Report G92 coordinate offset
            float g92_x, g92_y, g92_z;
            SETTINGS_GetG92Offset(&g92_x, &g92_y, &g92_z);
            p += snprintf(&buf[p], sizeof(buf)-p, "[G92:%.3f,%.3f,%.3f]\r\n", g92_x, g92_y, g92_z);
            
            // Report tool length offset
            float tlo = SETTINGS_GetToolLengthOffset();
            p += snprintf(&buf[p], sizeof(buf)-p, "[TLO:%.3f]\r\n", tlo);
            
            // Report probe position (currently not implemented - show zeros)
            p += snprintf(&buf[p], sizeof(buf)-p, "[PRB:0.000,0.000,0.000:0]\r\n");
            
            UART3_Write((uint8_t*)buf, (uint32_t)p);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'G') {
            char state_buffer[160];
            int l = 0;
            l += sprintf(&state_buffer[l], "[GC:");
            l += sprintf(&state_buffer[l], "G0 ");
            l += sprintf(&state_buffer[l], "G%d ", 54 + appData->activeWCS);  // Dynamic WCS (G54-G59)
            l += sprintf(&state_buffer[l], "G%d ", appData->modalPlane == 0 ? 17 : (appData->modalPlane == 1 ? 18 : 19));
            l += sprintf(&state_buffer[l], "%s ", appData->gcodeParser.unitsInches ? "G20" : "G21");
            l += sprintf(&state_buffer[l], "G%d ", appData->absoluteMode ? 90 : 91);
            l += sprintf(&state_buffer[l], "G94 ");
            l += sprintf(&state_buffer[l], "M5 ");
            l += sprintf(&state_buffer[l], "M9 ");
            l += sprintf(&state_buffer[l], "T%u ", appData->modalToolNumber);
            l += sprintf(&state_buffer[l], "F%.1f ", appData->modalFeedrate);
            l += sprintf(&state_buffer[l], "S%u", appData->modalSpindleRPM);
            l += sprintf(&state_buffer[l], "]\r\n");
            UART3_Write((uint8_t*)state_buffer, (uint32_t)l);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'H') {
            // $H - Homing cycle command
            // Create homing event and add to command queue
            if (cmdQueue->count < GCODE_MAX_COMMANDS) {
                strcpy(cmdQueue->commands[cmdQueue->head].command, "$H");
                cmdQueue->head = (cmdQueue->head + 1) % GCODE_MAX_COMMANDS;
                cmdQueue->count++;
            }
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'L') {
            // $L - Debug command: Show limit switch states
            CNC_Settings* settings = SETTINGS_GetCurrent();
            
            DEBUG_PRINT_GCODE("[LIMIT] Pins: X_Min=%d X_Max=%d Y_Min=%d Y_Max=%d Z_Min=%d Z_Max=%d A_Min=%d A_Max=%d\r\n",
                             LIMIT_GetMin(AXIS_X), LIMIT_GetMax(AXIS_X),
                             LIMIT_GetMin(AXIS_Y), LIMIT_GetMax(AXIS_Y),
                             LIMIT_GetMin(AXIS_Z), LIMIT_GetMax(AXIS_Z),
                             LIMIT_GetMin(AXIS_A), LIMIT_GetMax(AXIS_A));
            
