Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
            DEBUG_PRINT_GCODE("[LIMIT] Settings: $5=%u $21=%u (%s)\r\n", 
                             settings->limit_pins_invert,
                             settings->hard_limits_enable,
                             settings->hard_limits_enable ? "ENABLED" : "DISABLED");
            
            // Show which axes would trigger alarm
            bool any_triggered = false;
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                bool triggered = LIMIT_CheckAxis(axis, settings->limit_pins_invert);
                if (triggered) {
                    DEBUG_EXEC_GCODE({
                        char axis_name = 'X' + axis;
                        DEBUG_PRINT_GCODE("[LIMIT] *** AXIS %c TRIGGERED ***\r\n", axis_name);
                    });
                    any_triggered = true;
                }
            }
            if (!any_triggered) {
                DEBUG_PRINT_GCODE("[LIMIT] All clear - no limits triggered\r\n");
            }
            
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'I') {
            SETTINGS_PrintBuildInfo();
            handled = true;
            send_ok = false;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'N') {
            char buf[160];
            int p = 0;
            p += snprintf(&buf[p], sizeof(buf)-p, "[N0:%s]\r\n", appData->gcodeParser.startupLines[0]);
            p += snprintf(&buf[p], sizeof(buf)-p, "[N1:%s]\r\n", appData->gcodeParser.startupLines[1]);
            UART3_Write((uint8_t*)buf, (uint32_t)p);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'C') {
            appData->gcodeParser.grblCheckMode = !appData->gcodeParser.grblCheckMode;
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'X') {
            appData->gcodeParser.grblAlarm = false;
            // ✅ Clear hard limit alarm flag (set by stepper ISR)
            // g_hard_limit_alarm declared in stepper.h (already included at top)
            g_hard_limit_alarm = false;
            DEBUG_PRINT_GCODE("[GCODE] Alarm cleared via $X command\r\n");
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'F') {
            UART3_Write((uint8_t*)"[F:100|S:100]\r\n", 15);
            handled = true;
        }
        else if (len >= 5 && cmd[0] == '$' && cmd[1] == 'R' && cmd[2] == 'S' && cmd[3] == 'T' && cmd[4] == '=') {
            char target = cmd[5];
            if (target == '*') {
                SETTINGS_RestoreDefaults(SETTINGS_GetCurrent());
                appData->gcodeParser.grblAlarm = false;
            } else if (target == '$') {
                SETTINGS_RestoreDefaults(SETTINGS_GetCurrent());
            } else if (target == '#') {
                WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
                for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                    SET_COORDINATE_AXIS(&wcs->offset, axis, 0.0f);
                }
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
            }
            handled = true;
        }
        else if (len >= 4 && cmd[0] == '$' && cmd[1] == 'S' && cmd[2] == 'L' && cmd[3] == 'P') {
            UART3_Write((uint8_t*)"error:2\r\n", 10);
            send_ok = false;
            handled = true;
        }
        else if (cmd[0] == '$' && isdigit((unsigned char)cmd[1])) {
            char* pend;
            long param = strtol(&cmd[1], &pend, 10);
            if (param < 0) {
                UART3_Write((uint8_t*)"error:3\r\n", 10);
                send_ok = false;
                handled = true;
            } else if (*pend == '=') {
                float val = strtof(pend + 1, NULL);
                CNC_Settings* s = SETTINGS_GetCurrent();
                if (SETTINGS_SetValue(s, (uint32_t)param, val)) {
                    s->checksum = SETTINGS_CalculateCRC32(s);
                    
                    // ✅ Save to flash immediately so setting persists across resets
                    SETTINGS_SaveToFlash(s);
                    
                    // Reload stepper cached settings if step/dir/enable invert changed ($0-$5)
                    if (param <= 5) {
                        STEPPER_ReloadSettings();
                    }
                    
                    handled = true;
                } else {
                    UART3_Write((uint8_t*)"error:3\r\n", 10);
                    send_ok = false;
                    handled = true;
                }
            } else if (*pend == '\0') {
                float val = SETTINGS_GetValue(SETTINGS_GetCurrent(), (uint32_t)param);
                int out = snprintf((char*)txBuffer, sizeof(txBuffer), "$%ld=%g\r\n", param, val);
                UART3_Write(txBuffer, (uint32_t)out);
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 5 && cmd[0] == '$' && cmd[1] == 'S' && cmd[2] == 'A' && cmd[3] == 'V' && cmd[4] == 'E') {
            // $SAVE - Explicitly save current settings to flash
            CNC_Settings* settings = SETTINGS_GetCurrent();
            if (settings != NULL && SETTINGS_SaveToFlash(settings)) {
                UART3_Write((uint8_t*)"[MSG:Settings saved to flash]\r\n", 33);
            } else {
                UART3_Write((uint8_t*)"error:9\r\n", 10);  // Error 9: Flash write failed
                send_ok = false;
            }
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == '$') {
            // $$ - Print all settings
            SETTINGS_PrintAll(SETTINGS_GetCurrent());
            handled = true;
            send_ok = false;  // SETTINGS_PrintAll sends its own ok
        }
        else if (len == 1 && cmd[0] == '$') {
            UART3_Write((uint8_t*)"[HLP:$$ $# $G $I $N $C $X $F $RST= $SAVE $SLP $L]\r\n", 53);
            UART3_Write((uint8_t*)"[MSG:$21 Hard Limits Enable - $21=0 (disabled), $21=1 (enabled)]\r\n", 68);
            UART3_Write((uint8_t*)"[MSG:$5 Limit Pin Invert - NO switch:$5=0 (pin HIGH triggers), NC switch:$5=255 (pin LOW triggers)]\r\n", 103);
            UART3_Write((uint8_t*)"[MSG:$L - Show limit switch states (debug)]\r\n", 46);
            handled = true;
        }

        if (handled && send_ok) {
            UART_SendOK();
        } else if (!handled) {
            UART3_Write((uint8_t*)"error:4\r\n", 10);
        }

        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_GCODE_COMMAND:
    {
        uint32_t cmd_end = 0;
        for (uint32_t i = 0; i < nBytesRead; i++) {
            if (rxBuffer[i] == '\0') { cmd_end = i; break; }
        }
        DEBUG_PRINT_GCODE("[GCODE_CMD] Processing command: '%s'\r\n", rxBuffer);
        cmdQueue = Extract_CommandLineFrom_Buffer(rxBuffer, cmd_end, cmdQueue);
        
        // ✅ DISABLED: Startup deferral caused stalling with single arc commands
        // Normal flow control for all commands (immediate or deferred based on buffer)
        DEBUG_PRINT_GCODE("[GCODE_CMD] Normal flow control\r\n");
        SendOrDeferOk(appData, cmdQueue);
        
        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_ERROR:
    {
        uint32_t error_len = (uint32_t)sprintf((char*)txBuffer, "error:1\r\n");
        UART3_Write(txBuffer, error_len);
        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    default:
        break;
    }
}

/* Optional future advanced parsing disabled */
#if 0
#endif


